MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/spi_master/implementation_1/hal_ll_spi_master.c
    // Read the first data to be transmitted into the SPI_DR register.
    for(transfer_counter = 0; transfer_counter < read_data_length; transfer_counter++) {
        // If we are good to go ( if the value from shift register has been shifted to the rx register ), read the data.
         read_data_buffer[transfer_counter] = hal_ll_spi_master_transfer_bare_metal(hal_ll_hw_reg, dummy_data);
    }
}

static hal_ll_pin_name_t hal_ll_spi_master_check_pins(hal_ll_pin_name_t sck_pin, hal_ll_pin_name_t miso_pin, hal_ll_pin_name_t mosi_pin, hal_ll_spi_pin_id *index_list, hal_ll_spi_master_handle_register_t *handle_map) {
    static const uint16_t sck_map_size  = (sizeof(_spi_sck_map)) / (sizeof(hal_ll_spi_master_pin_map_t));
    static const uint16_t miso_map_size = (sizeof(_spi_miso_map)) / (sizeof(hal_ll_spi_master_pin_map_t));
    static const uint16_t mosi_map_size = (sizeof(_spi_mosi_map)) / (sizeof(hal_ll_spi_master_pin_map_t));
    uint8_t hal_ll_module_id = 0;
    uint8_t index_counter = 0;
    uint16_t miso_index;
    uint16_t mosi_index;
    uint16_t sck_index;

    if ( (HAL_LL_PIN_NC == sck_pin) || (HAL_LL_PIN_NC == miso_pin) || (HAL_LL_PIN_NC == mosi_pin) ) {
        return HAL_LL_PIN_NC;
    }

    // Check pins from the specific pin maps with the user defined pins.
    for (sck_index = 0; sck_index < sck_map_size; sck_index++) {
        if (_spi_sck_map[sck_index].pin == sck_pin) {
            for (miso_index = 0; miso_index < miso_map_size; miso_index++) {
                if (_spi_miso_map[miso_index].pin == miso_pin) {
                    if (_spi_sck_map[sck_index].module_index ==_spi_miso_map[miso_index].module_index) {
                        for (mosi_index = 0; mosi_index < mosi_map_size; mosi_index++) {
                            if (_spi_mosi_map[mosi_index ].pin ==  mosi_pin) {
                                if (_spi_sck_map[sck_index].module_index ==_spi_mosi_map[mosi_index].module_index) {
                                    // Get module number
                                    hal_ll_module_id = _spi_sck_map[ sck_index ].module_index;

                                    // Map pin names
                                    index_list[hal_ll_module_id].pin_sck = sck_index;
                                    index_list[hal_ll_module_id].pin_miso = miso_index;
                                    index_list[hal_ll_module_id].pin_mosi = mosi_index;

                                    // Check if module is taken
                                    if ( NULL == handle_map[hal_ll_module_id].hal_drv_spi_master_handle ) {
                                        return hal_ll_module_id;
                                    } else if ( SPI_MODULE_COUNT == ++index_counter ) {
                                        return --index_counter;
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }

    if ( index_counter ) {
        return hal_ll_module_id;
    } else {
        return HAL_LL_PIN_NC;
    }
}

static void hal_ll_spi_master_map_pins(uint8_t module_index, hal_ll_spi_pin_id *index_list) {
    // if every single pin is OK, insert them into this new map, and use this map in all low level functions.
    hal_ll_spi_master_hw_specifics_map[module_index].pins.sck.pin_name  = _spi_sck_map[index_list[module_index].pin_sck].pin;
    hal_ll_spi_master_hw_specifics_map[module_index].pins.miso.pin_name = _spi_miso_map[index_list[module_index].pin_miso].pin;
    hal_ll_spi_master_hw_specifics_map[module_index].pins.mosi.pin_name = _spi_mosi_map[index_list[module_index].pin_mosi].pin;

    // SCK, MISO and MOSI pins could have different alternate function settings, hence save all the AF-s.
    hal_ll_spi_master_hw_specifics_map[module_index].pins.sck.pin_af   = _spi_sck_map[index_list[module_index].pin_sck].af;
    hal_ll_spi_master_hw_specifics_map[module_index].pins.miso.pin_af  = _spi_miso_map[index_list[module_index].pin_miso].af;
    hal_ll_spi_master_hw_specifics_map[module_index].pins.mosi.pin_af  = _spi_mosi_map[index_list[module_index].pin_mosi].af;
}

static hal_ll_spi_master_hw_specifics_map_t *hal_ll_get_specifics(handle_t handle) {
    uint8_t hal_ll_module_count = sizeof(hal_ll_module_state) / (sizeof( hal_ll_spi_master_handle_register_t));

    static uint8_t hal_ll_module_error = sizeof(hal_ll_module_state) / (sizeof( hal_ll_spi_master_handle_register_t));

    while (hal_ll_module_count--) {
        if (hal_ll_spi_master_get_base_from_hal_handle == hal_ll_spi_master_hw_specifics_map[hal_ll_module_count].base) {
            return &hal_ll_spi_master_hw_specifics_map[hal_ll_module_count];
        }
    }

    // If NOK, return pointer to the last row of this map ( point to null pointer ).
    return &hal_ll_spi_master_hw_specifics_map[hal_ll_module_error];
}

static void hal_ll_spi_master_set_clock(hal_ll_spi_master_hw_specifics_map_t *map, bool hal_ll_state, uint32_t *clock_value) {
    rcc_clocks_t hal_ll_spi_clock_structure;

    RCC_GetClocksFrequency(&hal_ll_spi_clock_structure);

    switch (map->module_index) {
        #if defined(SPI_MODULE_1)
        case (hal_ll_spi_master_module_num(SPI_MODULE_1)):
            if(hal_ll_state) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI1_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI1_MASTER_ENABLE);
            }
            #if defined (STM32F0xx) || (STM32G0xx)
            *clock_value = hal_ll_spi_clock_structure.pclk;
            #else
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            #endif
            break;
        #endif
        #if defined(SPI_MODULE_2)
        case (hal_ll_spi_master_module_num(SPI_MODULE_2)):
            if(hal_ll_state) {
                #ifdef STM32L4xx
                    set_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI2_MASTER_ENABLE);
                #else
                    set_reg_bit(_RCC_APB1ENR, HAL_LL_SPI2_MASTER_ENABLE);
                #endif
            } else {
                #ifdef STM32L4xx
                    clear_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI2_MASTER_ENABLE);
                #else
                    clear_reg_bit(_RCC_APB1ENR, HAL_LL_SPI2_MASTER_ENABLE);
                #endif
            }
            #if defined (STM32F0xx) || (STM32G0xx)
            *clock_value = hal_ll_spi_clock_structure.pclk;
            #else
            *clock_value = hal_ll_spi_clock_structure.pclk1;
            #endif
            break;
        #endif
        #if defined(SPI_MODULE_3)
        case (hal_ll_spi_master_module_num(SPI_MODULE_3)):
            if(hal_ll_state) {
                #ifdef STM32L4xx
                    set_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI3_MASTER_ENABLE);
                #else
                    set_reg_bit(_RCC_APB1ENR, HAL_LL_SPI3_MASTER_ENABLE);
                #endif
            } else {
                #ifdef STM32L4xx
                    clear_reg_bit(_RCC_APB1ENR1, HAL_LL_SPI3_MASTER_ENABLE);
                #else
                    clear_reg_bit(_RCC_APB1ENR, HAL_LL_SPI3_MASTER_ENABLE);
                #endif
            }
            *clock_value = hal_ll_spi_clock_structure.pclk1;
            break;
        #endif
        #if defined(SPI_MODULE_4)
        case (hal_ll_spi_master_module_num(SPI_MODULE_4)):
            if(hal_ll_state) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI4_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI4_MASTER_ENABLE);
            }
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            break;
        #endif
        #if defined(SPI_MODULE_5)
        case (hal_ll_spi_master_module_num(SPI_MODULE_5)):
            if( hal_ll_state ) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI5_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI5_MASTER_ENABLE);
            }
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            break;
        #endif
        #if defined(SPI_MODULE_6)
        case (hal_ll_spi_master_module_num(SPI_MODULE_6)):
            if(hal_ll_state) {
                set_reg_bit(_RCC_APB2ENR, HAL_LL_SPI6_MASTER_ENABLE);
            } else {
                clear_reg_bit(_RCC_APB2ENR, HAL_LL_SPI6_MASTER_ENABLE);
            }
            *clock_value = hal_ll_spi_clock_structure.pclk2;
            break;
        #endif

